Revit 2026 API

# WorksetId Methods

---

The WorksetId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Compare | Compares two WorksetIds. |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the integer value of the id as hash code (Overrides ObjectGetHashCode) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Gets a String representation of the integer value of the id. (Overrides ObjectToString) |

#### Reference

WorksetId Class

Autodesk.Revit.DB Namespace